Revit 2026 API

# RebarShapeConstraintCircumference Class

---

A circumference constraint associated with an arc in a RebarShapeDefinition.

SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintCircumference

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarShapeConstraintCircumference : RebarShapeConstraint
```
```vb
Public Class RebarShapeConstraintCircumference
	Inherits RebarShapeConstraint
```
```cpp
public ref class RebarShapeConstraintCircumference : public RebarShapeConstraint
```
```fsharp
type RebarShapeConstraintCircumference =
    class
        inherit RebarShapeConstraint
    end
```

The RebarShapeConstraintCircumference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RebarShapeConstraintCircumference | Create a circumference constraint. |

|  | Name | Description |
| --- | --- | --- |
|  | ArcReferenceType | The choice of rule for measuring the diameter. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RebarShapeConstraint) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetParamId | Return the Id of the parameter associated with this constraint. (Inherited from RebarShapeConstraint) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace